{"BALLSCOUNT":256,"matchId":"100_VS_200_1","firstInnings":[{"over":[{"bowlerId":210,"batterId":102,"score":0,"result":"DOTBALL","description":"Siraj to Gaikwad, no run, starts off with an away-seamer does Siraj. Back of a length around off and Gaikwad defends it into the off-side watchfully"},{"bowlerId":210,"batterId":102,"score":1,"result":"ONE","description":"Siraj to Gaikwad, 1 run, taps the length ball in front of point with soft hands and takes a single to get off the mark. Suyash Prabhudessai grabs the ball and has a shy at Uthappa\u0027s end, but fails to hit as he was in an awkward position while he went for the throw"},{"bowlerId":210,"batterId":101,"score":1,"result":"ONE","description":"Siraj to Uthappa, 1 run, 135 kph, swinging away from the batter from a good length, Uthappa opens the bat face and gets an educated outside edge to third man"},{"bowlerId":210,"batterId":102,"score":4,"result":"FOUR","description":"Siraj to Gaikwad, FOUR, edged away! Was thinking to lift his bat on this occasion was Gaikwad, but the ball shapes away, clips his bat and flies past the fielder at first slip. Third man was way too square to cut this down. Also, Gaikwad was slightly late to lift his bat, hence the bottom edge was induced"},{"bowlerId":210,"batterId":102,"score":0,"result":"DOTBALL","description":"Siraj to Gaikwad, no run, back of a length around off, Gaikwad knocks this into the off-side"},{"bowlerId":210,"batterId":102,"score":0,"result":"DOTBALL","description":"Siraj to Gaikwad, no run, decent first over by Siraj. Ends it with a shortish delivery and Gaikwad rides the bounce to nudge this in front of mid-wicket"}]},{"over":[{"bowlerId":209,"batterId":101,"score":0,"result":"DOTBALL","description":"Hazlewood to Uthappa, no run, on a length around off, Uthappa stays put and defends this into the off-side"},{"bowlerId":209,"batterId":101,"score":0,"result":"DOTBALL","description":"Hazlewood to Uthappa, no run, spears this one on a good length, Uthappa covers the line and clips this to mid-on"},{"bowlerId":209,"batterId":101,"score":1,"result":"ONE","description":"Hazlewood to Uthappa, 1 run, risky single taken by Uthappa as he eases this in front of mid-on with soft hands and scampers across to the other end. Had Faf managed to get a direct-hit at Uthappa\u0027s end, he would have been a goner"},{"bowlerId":209,"batterId":102,"score":1,"result":"ONE","description":"Hazlewood to Gaikwad, 1 run, banged in short by Hazlewood, this one shapes away, Gaikwad rides the bounce and steers it to third man"},{"bowlerId":209,"batterId":101,"score":2,"result":"DOTBALL","description":"Hazlewood to Uthappa, no run, 134.3kph, short and quick around middle and leg, Uthappa hops a touch and nudges this to mid-on"},{"bowlerId":209,"batterId":101,"score":0,"result":"DOTBALL","description":"Hazlewood to Uthappa, no run, just a couple of runs in Hazlewood\u0027s opening over. Quite an economical start that. Was a length ball around off and Uthappa knocked it to mid-off as he played it off his front foot"}]},{"over":[{"bowlerId":210,"batterId":102,"score":0,"result":"DOTBALL","description":"Siraj to Gaikwad, no run, pitched up by Siraj, Gaikwad times his off-drive, but can\u0027t get it past the fielder at wide mid-off"},{"bowlerId":210,"batterId":102,"score":4,"result":"FOUR","description":"Siraj to Gaikwad, FOUR, short and punished! Rocks back in the crease and hammers the pull over square leg for a cracking boundary does Gaikwad. That shall give him a lot of confidence, was struck right of the meat"},{"bowlerId":210,"batterId":102,"score":0,"result":"DOTBALL","description":"Siraj to Gaikwad, no run, 13210.8kph, on a length outside off and Gaikwad punches it to cover-point"},{"bowlerId":210,"batterId":102,"score":2,"result":"TWO","description":"Siraj to Gaikwad, 2 runs, drifting on the pads, Gaikwad nudges it to deep mid-wicket where there\u0027s a slight fumble by Maxwell. Two runs taken eventually"},{"bowlerId":210,"batterId":102,"score":0,"result":"DOTBALL","description":"Siraj to Gaikwad, no run, rides the bounce and taps this towards the bowler\u0027s left-side, he sets off for a single, but sent back by Uthappa"},{"bowlerId":210,"batterId":102,"score":1,"result":"ONE","description":"Siraj to Gaikwad, 1 run, back of a length outside off, Gaikwad opens the bat face and steers this to short third man for a single"}]},{"over":[{"bowlerId":209,"batterId":102,"score":4,"result":"FOUR","description":"Hazlewood to Gaikwad, FOUR, slight width on offer, Gaikwad rocks back in the crease and times his square cut to perfection. Manages to get it past point\u0027s left-side as the ball races along the carpet and is away to the fence in no time"},{"bowlerId":209,"batterId":102,"score":0,"result":"DOTBALL","description":"Hazlewood to Gaikwad, no run, short of a length outside off, Gaikwad steers it to backward point"},{"bowlerId":209,"batterId":102,"score":0,"result":"DOTBALL","description":"Hazlewood to Gaikwad, no run, 137.1kph, back of a length outside off, this ball keeps a touch low and Gaikwad steers it towards backward point"},{"bowlerId":209,"batterId":102,"score":0,"result":"LBW","description":"Hazlewood to Gaikwad, THATS OUT!! Lbw!!"},{"bowlerId":209,"batterId":103,"score":0,"result":"DOTBALL","description":"Hazlewood to Moeen Ali, no run, 13209.2kph, pitched up by Hazlewood and the batter has driven this off his front foot, played to wide mid-off"},{"bowlerId":209,"batterId":103,"score":0,"result":"DOTBALL","description":"Hazlewood to Moeen Ali, no run, short of a length around off, Moeen Ali stands tall and knocks it to mid-off with a gentle push"}]},{"over":[{"bowlerId":210,"batterId":101,"score":1,"result":"ONE","description":"Siraj to Uthappa, 1 run, short and quick around off, Uthappa opens the bat face and steers this to third man for a single"},{"bowlerId":210,"batterId":103,"score":0,"result":"DOTBALL","description":"Siraj to Moeen Ali, no run, short of a length around off, Moeen Ali knocks this back to the bowler"},{"bowlerId":210,"batterId":103,"score":1,"result":"ONE","description":"Siraj to Moeen Ali, 1 run, on a length outside off, Moeen Ali goes for a drive away from his body and gets an outside edge to third man"},{"bowlerId":210,"batterId":101,"score":0,"result":"DOTBALL","description":"Siraj to Uthappa, no run, 137.8kph, back of a length around off, doesn\u0027t deviate much as Uthappa punches it to short cover"},{"bowlerId":210,"batterId":101,"score":0,"result":"DOTBALL","description":"Siraj to Uthappa, no run, shuffles across in the crease and clips this to mid-on. Played that uppishly as it landed just in front of Rawat"},{"bowlerId":210,"batterId":101,"score":4,"result":"FOUR","description":"Siraj to Uthappa, FOUR, some respite for CSK as the runs had dried up in the last couple of overs. Fraction short outside off, Uthappa frees his arms and slams this over cover for his first boundary of the match. Commendable effort by the RCB bowlers with the new ball so far though"}]},{"over":[{"bowlerId":211,"batterId":103,"score":1,"result":"ONE","description":"Akash Deep to Moeen Ali, 1 run, on a length around off, Moeen Ali knocks this firmly to Faf at mid-off for a quick single"},{"bowlerId":211,"batterId":101,"score":1,"result":"ONE","description":"Akash Deep to Uthappa, 1 run, short of a length around middle and leg, Uthappa shuffles across and flicks this to deep mid-wicket for a single"},{"bowlerId":211,"batterId":103,"score":1,"result":"ONE","description":"Akash Deep to Moeen Ali, 1 run, 138kph, short one around middle and leg, Moeen Ali gets hurried up due to the pace as he gets an inside edge on to the pads, and the ball lobs towards point"},{"bowlerId":211,"batterId":101,"score":0,"result":"DOTBALL","description":"Akash Deep to Uthappa, no run, walks across in the crease and tries to whip this across the line, makes no contact though and is struck on the pads. The impact was well outside off"},{"bowlerId":211,"batterId":101,"score":6,"result":"SIX","description":"Akash Deep to Uthappa, SIX, every now and then Uthappa keeps giving us a glimpse of what he can do. Just that he needs to be a bit more consistent. On a length around off, Uthappa gets hold of this and thumps it right over the bowler\u0027s head as the ball goes the distance"},{"bowlerId":211,"batterId":101,"score":1,"result":"ONE","description":"Akash Deep to Uthappa, leg byes, 1 run, banged in short by Akash Deep, around off, Uthappa looks to swipe this through the leg-side, gets hit on the thigh pad"}]},{"over":[{"bowlerId":204,"batterId":101,"score":0,"result":"DOTBALL","description":"Maxwell to Uthappa, no run, tries to punch this, gets an inside edge on to the pads"},{"bowlerId":204,"batterId":101,"score":1,"result":"ONE","description":"Maxwell to Uthappa, 1 run, fraction short around middle and leg, Uthappa walks across and clips this through the leg-side for a single"},{"bowlerId":204,"batterId":103,"score":0,"result":"DOTBALL","description":"Maxwell to Moeen Ali, no run, short again and Moeen Ali defends it off his back foot"},{"bowlerId":204,"batterId":103,"score":0,"result":"RUNOUT","description":"Maxwell to Moeen Ali, THATS OUT!! Run Out!!"},{"bowlerId":204,"batterId":105,"score":0,"result":"DOTBALL","description":"Maxwell to Shivam Dube, no run, floated around off, Shivam Dube defends it from within the crease"},{"bowlerId":204,"batterId":105,"score":1,"result":"ONE","description":"Maxwell to Shivam Dube, 1 run, tossed up delivery around off, touch fuller and Shivam Dube has driven this down to long-off for a single"}]},{"over":[{"bowlerId":211,"batterId":105,"score":1,"result":"ONE","description":"Akash Deep to Shivam Dube, 1 run, short of a length outside off, Shivam Dube cuts this to deep point for a single"},{"bowlerId":211,"batterId":101,"score":4,"result":"FOUR","description":"Akash Deep to Uthappa, FOUR, nicely done! Short ball outside off, Uthappa rides the bounce and steers this past the fielder at short third man with finesse. Guided it well past the man inside the ring as the ball raced away to the third man boundary"},{"bowlerId":211,"batterId":101,"score":1,"result":"ONE","description":"Akash Deep to Uthappa, 1 run, short one again, Uthappa nudges this to long-on for a single"},{"bowlerId":211,"batterId":105,"score":4,"result":"FOUR","description":"Akash Deep to Shivam Dube, FOUR, a loose over this by Akash Deep. Short ball down leg and Shivam Dube has helped it away to the fine leg fence. Easy pickings those"},{"bowlerId":211,"batterId":105,"score":0,"result":"DOTBALL","description":"Akash Deep to Shivam Dube, no run, on a length around off, Shivam Dube knocks this firmly to cover"},{"bowlerId":211,"batterId":105,"score":0,"result":"DOTBALL","description":"Akash Deep to Shivam Dube, no run, 134.1kph, short ball around off, Shivam Dube plays it with soft hands, steering it to point"}]},{"over":[{"bowlerId":204,"batterId":101,"score":0,"result":"DOTBALL","description":"Maxwell to Uthappa, no run, big lbw shout by Maxwell. But this was pitching outside leg and spinning down leg probably. Uthappa was trying to clip it through the on-side, as he got beaten due to the spin and rapped on the pads"},{"bowlerId":204,"batterId":101,"score":1,"result":"ONE","description":"Maxwell to Uthappa, 1 run, knocked down to long-on by Uthappa for a single"},{"bowlerId":204,"batterId":105,"score":0,"result":"DOTBALL","description":"Maxwell to Shivam Dube, no run, flighted delivery around off, spinning away from the batter, Shivam Dube guides it to short third man"},{"bowlerId":204,"batterId":105,"score":6,"result":"SIX","description":"Maxwell to Shivam Dube, SIX, smoked over long-on. A loopy delivery by Maxwell and Shivam Dube has launched it over long-on for a massive six. 94 metres strike that by the powerful southpaw as it came right of the meat"},{"bowlerId":204,"batterId":105,"score":0,"result":"DOTBALL","description":"Maxwell to Shivam Dube, no run, drags back the length slightly and Shivam Dube stays put and knocks it back to Maxwell"},{"bowlerId":204,"batterId":105,"score":1,"result":"ONE","description":"Maxwell to Shivam Dube, 1 run, fraction short outside off, Shivam Dube punches it off his back foot to sweeper cover"}]},{"over":[{"bowlerId":206,"batterId":105,"score":0,"result":"DOTBALL","description":"Shahbaz Ahmed to Shivam Dube, no run, tossed up delivery around off, Shivam Dube looks to flick this through the leg-side, gets an inside edge towards short fine leg"},{"bowlerId":206,"batterId":105,"score":1,"result":"ONE","description":"Shahbaz Ahmed to Shivam Dube, 1 run, touch short around middle and leg, Shivam Dube clips this to backward square leg for a single"},{"bowlerId":206,"batterId":101,"score":1,"result":"ONE","description":"Shahbaz Ahmed to Uthappa, 1 run, carved through backward point for a single"},{"bowlerId":206,"batterId":105,"score":1,"result":"ONE","description":"Shahbaz Ahmed to Shivam Dube, 1 run, tossed up delivery around middle and leg, Shivam Dube clips it to wide long-on for a single"},{"bowlerId":206,"batterId":101,"score":1,"result":"ONE","description":"Shahbaz Ahmed to Uthappa, 1 run, fraction short outside off, Uthappa punches it through the off-side for a single"},{"bowlerId":206,"batterId":105,"score":1,"result":"ONE","description":"Shahbaz Ahmed to Shivam Dube, 1 run, drifting on the pads, straighter delivery that has been clipped through square leg for a single to end the over"}]},{"over":[{"bowlerId":207,"batterId":105,"score":0,"result":"DOTBALL","description":"Hasaranga to Shivam Dube, no run, starts off with a googly does Hasaranga, Shivam Dube goes down on his knee, it\u0027s a swing and a miss"},{"bowlerId":207,"batterId":105,"score":6,"result":"SIX","description":"Hasaranga to Shivam Dube, SIX, welcome into the attack, Mr. Hasaranga. Tosses this up around off, Shivam Dube gets underneath it and launches it over long-on for another high and handsome six. Hasaranga on the back foot after that strike"},{"bowlerId":207,"batterId":105,"score":1,"result":"ONE","description":"Hasaranga to Shivam Dube, 1 run, short and wide outside off, Shivam Dube rocks back and punches this to sweeper cover for a single"},{"bowlerId":207,"batterId":101,"score":1,"result":"ONE","description":"Hasaranga to Uthappa, 1 run, another wrong \u0027un around middle and leg, Uthappa clips this off an inside edge towards short fine leg for a single"},{"bowlerId":207,"batterId":105,"score":4,"result":"FOUR","description":"Hasaranga to Shivam Dube, FOUR, no chance of stopping that! Shivam Dube turning it on at DY Patil. A short ball the leg spinner and Shivam Dube rocks back in the crease to hammer the pull through mid-wicket. Bisects a couple of fielders haring across in the deep and Hasaranga is proving to be expensive in his opening over"},{"bowlerId":207,"batterId":105,"score":1,"result":"ONE","description":"Hasaranga to Shivam Dube, 1 run, on the pads and Shivam Dube has clipped this through the leg-side for a single"}]},{"over":[{"bowlerId":206,"batterId":105,"score":1,"result":"ONE","description":"Shahbaz Ahmed to Shivam Dube, 1 run, touch short around middle and leg, Shivam Dube treks back and clips this to square leg"},{"bowlerId":206,"batterId":101,"score":2,"result":"TWO","description":"Shahbaz Ahmed to Uthappa, 2 runs, played square of the wicket on the off-side as the fielder has to cover a lot of ground, allowing the batter to come back for the second"},{"bowlerId":206,"batterId":101,"score":1,"result":"ONE","description":"Shahbaz Ahmed to Uthappa, 1 run, fraction short outside off again, and Uthappa has punched this through cover-point\u0027"},{"bowlerId":206,"batterId":105,"score":2,"result":"TWO","description":"Shahbaz Ahmed to Shivam Dube, 2 runs, full and wide outside off, Shivam Dube slices this through point where the fielder can\u0027t stop the ball, however, Prabhudessai sprints across to his right and puts in a dive to stop the ball near the boundary"},{"bowlerId":206,"batterId":105,"score":6,"result":"SIX","description":"Shahbaz Ahmed to Shivam Dube, SIX, Shivam Dube continues to be explosive against the spinners. A loopy delivery by Shahbaz Ahmed and the southpaw goes down on his knee to smoke this out of the park over deep mid-wicket. Clean as a whistle as the partnership between Dube and Uthappa continues to propel"},{"bowlerId":206,"batterId":105,"score":1,"result":"ONE","description":"Shahbaz Ahmed to Shivam Dube, 1 run, 50-run stand up for the third wicket. Floated around off, Shivam Dube pushes this in front of cover with soft hands and takes a single"}]},{"over":[{"bowlerId":204,"batterId":105,"score":1,"result":"ONE","description":"Maxwell to Shivam Dube, 1 run, a lot slower through the air around middle and leg, Shivam Dube lofts it down to long-on, but that was a half hearted shot"},{"bowlerId":204,"batterId":101,"score":6,"result":"SIX","description":"Maxwell to Uthappa, SIX, he has still got it in him. A short ball by Maxwell, Uthappa rocks back in the crease and pulls it over deep mid-wicket for half-a-dozen. Shot!"},{"bowlerId":204,"batterId":101,"score":6,"result":"SIX","description":"Maxwell to Uthappa, SIX, make that two in two. A floated delivery around middle and leg, Uthappa picks the bones out of it as he clubs it over deep mid-wicket for another towering six"},{"bowlerId":204,"batterId":101,"score":0,"result":"DOTBALL","description":"Maxwell to Uthappa, no run, fraction short outside off, Uthappa opens the bat face and steers this to short third man"},{"bowlerId":204,"batterId":101,"score":0,"result":"DOTBALL","description":"Maxwell to Uthappa, no run, knocked in front of short cover by Uthappa, soft handsl"},{"bowlerId":204,"batterId":101,"score":6,"result":"SIX","description":"Maxwell to Uthappa, SIX, 45 runs off the final 3 overs! 19 runs off this one. A tossed up delivery by Maxwell and the batter has swung this over deep mid-wicket for a humongous six again. Runs coming thick and fast as both the batters are dealing in sixes at the moment. This is getting exciting!"}]},{"over":[{"bowlerId":207,"batterId":105,"score":0,"result":"DOTBALL","description":"Hasaranga to Shivam Dube, no run, oh what a ball! Gets the googly spot on pitching on middle, Dube is cement feeted. Just pokes at it as he didn\u0027t read this from the hand, very lucky this bounced over the stumps"},{"bowlerId":207,"batterId":105,"score":4,"result":"FOUR","description":"Hasaranga to Shivam Dube, FOUR, in the airrrr, in the gap so not a catch. Maxi runs to his left and stretches to flick it back. Pulls the ball back, but himself signals four because his back leg was touching the rope, making it easy for the third ump"},{"bowlerId":207,"batterId":105,"score":2,"result":"TWO","description":"Hasaranga to Shivam Dube, 2 runs, ah Shivam Dube moving his front foot to slog this across the line. Almost an outstanding catch at deep square leg though. Fielder dived forward running to his right but couldn\u0027t hold on"},{"bowlerId":207,"batterId":105,"score":4,"result":"BYES","description":"Hasaranga to Shivam Dube, byes, FOUR, again almost bowled! Hasaranga troubling Dube with his googly. Dube had no clue to this and was totally opened up. DK thought this was going to crash into the stumps and he wasn\u0027t covering the line too. Four more, CSK won\u0027t mind"},{"bowlerId":207,"batterId":105,"score":1,"result":"WIDE","description":"Hasaranga to Shivam Dube, wide, fired down leg"},{"bowlerId":207,"batterId":105,"score":1,"result":"ONE","description":"Hasaranga to Shivam Dube, 1 run, shortish delivery, Dube works it away to square leg"},{"bowlerId":207,"batterId":101,"score":1,"result":"ONE","description":"Hasaranga to Uthappa, 1 run, flatter delivery, Uthappa works it to long-on"}]},{"over":[{"bowlerId":211,"batterId":101,"score":0,"result":"DOTBALL","description":"Akash Deep to Uthappa, no run, Uthappa steps out but yorks himself out. Tried to squeeze it past point but missed"},{"bowlerId":211,"batterId":101,"score":4,"result":"FOUR","description":"Akash Deep to Uthappa, FOUR, lovely flick shot! Oh look at Maxi give up. Such a gun fielder, but the timing on this flick was brilliant and long-on couldn\u0027t cut it off. Fifty for Robbie. Such a mature and important innings. CSK openers weren\u0027t carrying on this season, but Uthappa dug deep and hit top gear once the spinners came on"},{"bowlerId":211,"batterId":101,"score":6,"result":"SIX","description":"Akash Deep to Uthappa, SIX, RCB got to stop offering freebies, Michael Hussey in a sideline interview is all smiles. Why not! Akash Deep bowls a poor short delivery down leg, Uthappa gets inside the line and pulls over short fine leg"},{"bowlerId":211,"batterId":101,"score":0,"result":"DOTBALL","description":"Akash Deep to Uthappa, no run, yorker, pretty well executed. Uthappa digs it out back to the bowler"},{"bowlerId":211,"batterId":101,"score":1,"result":"ONE","description":"Akash Deep to Uthappa, 1 run, oh rushed him on the pull shot! Uthappa wanted to target mid-wicket, the ball is sliced as it came quicker than expected. The ball lobs to mid-off"},{"bowlerId":211,"batterId":105,"score":4,"result":"FOUR","description":"Akash Deep to Shivam Dube, FOUR, in the airrr, clears the leaping backward point and that is Shivam Dube\u0027s fifty as well. Came in with a big responsibility of lifting the scoreboard pressure. Took his chances, hit some fine sixes and also placed the ball well in the gaps. Full slower delivery outside off stump, Dube slices it over point to end the over on a high and the CSK fans love it"}]},{"over":[{"bowlerId":209,"batterId":101,"score":1,"result":"ONE","description":"Hazlewood to Uthappa, 1 run, pulled uppishly, doesn\u0027t carry to deep mid-wicket. Good effort diving forward from Suyash Prabhudessai. It was a shortish delivery, but not short enough for Uthappa to get under and pull with control"},{"bowlerId":209,"batterId":105,"score":1,"result":"ONE","description":"Hazlewood to Shivam Dube, 1 run, short of length delivery, Dube guides the pull to deep mid-wicket"},{"bowlerId":209,"batterId":101,"score":6,"result":"SIX","description":"Hazlewood to Uthappa, SIX, asking to be hit! Gift from Josh to his former teammate. Rayudu loved the shot in the dug out. Uthappa tried to pull the first ball of the over and almost holed out. But this was shorter and slower. He picked the slower delivery, waited and nailed the pull shot for a handsome six over mid-wicket"},{"bowlerId":209,"batterId":101,"score":0,"result":"DOTBALL","description":"Hazlewood to Uthappa, no run, tries the pull again and misses. CSK now into fearless cricket zone!"},{"bowlerId":209,"batterId":101,"score":1,"result":"ONE","description":"Hazlewood to Uthappa, 1 run, full and outside off stump, Uthappa square drives, disappointed he picked out deep point"},{"bowlerId":209,"batterId":105,"score":1,"result":"WIDE","description":"Hazlewood to Shivam Dube, wide, fired down leg as Hazlewood tries the yorker"},{"bowlerId":209,"batterId":105,"score":2,"result":"TWO","description":"Hazlewood to Shivam Dube, 2 runs, yorker, Dube flicks it to mid-wicket and they quickly get two"}]},{"over":[{"bowlerId":210,"batterId":101,"score":0,"result":"DOTBALL","description":"Siraj to Uthappa, no run, oh he has missed out on a leg-side freebie. Uthappa tried to pull fine, missed the ball. Lobs straight to short fine leg off the thigh pad, so no appeal for catch"},{"bowlerId":210,"batterId":101,"score":6,"result":"SIX","description":"Siraj to Uthappa, SIX, when it works, it works wonders for you! Siraj will argue he didn\u0027t bowl a bad ball. He will also support the thought by saying the batter actually tried a leg-side slog, but this flew off the outside edge over third man"},{"bowlerId":210,"batterId":101,"score":6,"result":"SIX","description":"Siraj to Uthappa, SIX, but this is a stunning shot from Uthappa. It\u0027s not his usual walk at the bowler for a straight six like he he Brett Lee at the Wankhede in 2007. He danced out this time and played a proper flat-bat hit straight down the ground"},{"bowlerId":210,"batterId":101,"score":4,"result":"FOUR","description":"Siraj to Uthappa, FOUR, Siraj thought it went off the pad. The ball didn\u0027t fly off the bat so that might have tricked him into thinking it was pad or thigh pad. But it only touched the bat. Uthappa moved across and just helped it away fine to the right of short fine leg"},{"bowlerId":210,"batterId":101,"score":0,"result":"DOTBALL","description":"Siraj to Uthappa, no run, short delivery, Uthappa pulls and misses"},{"bowlerId":210,"batterId":101,"score":1,"result":"NOBALL","description":"Siraj to Uthappa, no ball, in the airrr, outstanding catch from Suyash Prabhudessai. Uthappa walks off after a very good innings. Oh dear, the buzzer is off. Get back Robbie. He hasn\u0027t realised yet and the ump calls him back. Siraj has overtstepped. That smile on Siraj\u0027s face turns into a scratch of the head in seconds. This was a full delivery that Uthappa tried to flick, hit it well but didn\u0027t hit the gap. The fielder covered a good distance to his left and took a well judged catch. Goes in vain"},{"bowlerId":210,"batterId":105,"score":1,"result":"ONE","description":"Siraj to Shivam Dube, 1 run, wide yorker, Dube drills it to long-off"}]},{"over":[{"bowlerId":211,"batterId":105,"score":6,"result":"SIX","description":"Akash Deep to Shivam Dube, SIX, Akash Deep has been smashed deep into the long-on stands. Game on margins. Actually not a really poor ball because Akash Deep went for the yorker. Although he missed it he did cramp Dube for room. But Dube plays an outstanding straight-batted loft and times it sweetly"},{"bowlerId":211,"batterId":105,"score":4,"result":"FOUR","description":"Akash Deep to Shivam Dube, FOUR, clever! Short slower delivery outside off stump, Dube guides past DK and third man is in. 10 off the first two"},{"bowlerId":211,"batterId":105,"score":2,"result":"TWO","description":"Akash Deep to Shivam Dube, 2 runs, top edgeeee, clears DK and short third man. Oh could have been a runout at the striker\u0027s end but they miss. The bowler ran to the stumps but didn\u0027t collect the ball before breaking the stumps"},{"bowlerId":211,"batterId":105,"score":6,"result":"SIX","description":"Akash Deep to Shivam Dube, SIX, this is getting out of control for RCB. High full toss, Dube\u0027s eyes lit up. He had to reach out a bit but timed it so sweetly and smashed it over point. Siraj puts his arm over Akash Deep\u0027s shoulder for some words"},{"bowlerId":211,"batterId":105,"score":1,"result":"WIDE","description":"Akash Deep to Shivam Dube, wide, fired down leg trying the yorker"},{"bowlerId":211,"batterId":105,"score":1,"result":"ONE","description":"Akash Deep to Shivam Dube, 1 run, shortish and on the leg stump, Dube mistimes the pull, the ball rolls to short fine leg off the glove"},{"bowlerId":211,"batterId":101,"score":1,"result":"WIDE","description":"Akash Deep to Uthappa, wide, oh called a wide. Is that Harsh? Uthappa moved a long way across and that is what DK and the bowler were suggesting but the ump is saying the ball landed on the edge of the pitch, so seems fair. They check for the no-ball too because if the ball lands outside the pitch it will be a no ball. Just fine on that count"},{"bowlerId":211,"batterId":101,"score":1,"result":"WIDE","description":"Akash Deep to Uthappa, wide, another off-side wide"},{"bowlerId":211,"batterId":101,"score":1,"result":"WIDE","description":"Akash Deep to Uthappa, wide, again a wide yorker attempt goes for a wide. 150 partnership"},{"bowlerId":211,"batterId":101,"score":1,"result":"ONE","description":"Akash Deep to Uthappa, 1 run, oh he swings hard and mistimes the full toss along the ground to deep mid-wicket"}]},{"over":[{"bowlerId":207,"batterId":101,"score":6,"result":"SIX","description":"Hasaranga to Uthappa, SIX, Uthappa loves smacking the spinners and Hasaranga is in the firing line. Steps out and picks the googly, plays a stunning flat-hit over the bowler\u0027s head. He is only a couple of hits away from a hundred now"},{"bowlerId":207,"batterId":101,"score":1,"result":"ONE","description":"Hasaranga to Uthappa, leg byes, 1 run, tries the reverse sweep and misses, the ball goes to the off-side off the thigh pad"},{"bowlerId":207,"batterId":105,"score":6,"result":"SIX","description":"Hasaranga to Shivam Dube, SIX, muscled! 200 up for CSK. What a stunning partnership this has been, one of the best since the inception of the IPL. Hasaranga knows he has bowled a poor ball as he walks back to his mark. Googly but short and sitting nicely for Dube. Difficult to generate power off the back foot for a loft over long-on, but Dube timed it to perfection"},{"bowlerId":207,"batterId":105,"score":1,"result":"ONE","description":"Hasaranga to Shivam Dube, 1 run, smashed down the ground but long-off cuts it off"},{"bowlerId":207,"batterId":101,"score":0,"result":"CATCH","description":"Hasaranga to Uthappa, out Caught by Kohli!! In the airrr, not timed that well and finds Virat at deep mid-wicket. Robbie misses a deserved hundred. Gets a great ovation from the CSK fans. He walks off raising the bat. Hasaranga cramped Uthappa with the googly this time, so the batter couldn\u0027t really get under the ball to time it right. Uthappa got his eye in and then put on a stunning display of hitting. "},{"bowlerId":207,"batterId":106,"score":0,"result":"CATCH","description":"Hasaranga to Jadeja, out Caught by Anuj Rawat!! Mistimed and he holes out to deep mid-wicket. Some respite for Hasaranga but RCB know this won\u0027t matter much because the damage has already been done. Hasaranga inviting Jadeja for a slog-sweep, bit of a top edge and Rawat judged that nicely diving to his right for a low catch"}]},{"over":[{"bowlerId":209,"batterId":105,"score":6,"result":"SIX","description":"Hazlewood to Shivam Dube, SIX, what a shot! That front leg clearance, more importantly that straight-batted loft. Such a difficult hit but he has made it look so simple. Hazlewood missed the yorker and that was in the slot for Dube to tee off. 14 away from a hundred, can he get it?"},{"bowlerId":209,"batterId":105,"score":0,"result":"DOTBALL","description":"Hazlewood to Shivam Dube, no run, full toss down leg, Dube moves inside the line and looks to glance fine, but misses. He is disappointed that he missed the freebie. Ball hit the strap on the pad so not called a wide. Good umpiring"},{"bowlerId":209,"batterId":105,"score":0,"result":"DOTBALL","description":"Hazlewood to Shivam Dube, no run, lovely short delivery, Dube looks to pull and misses. Been a good comeback from Hazlewood. Who will have the last laugh?"},{"bowlerId":209,"batterId":105,"score":6,"result":"SIX","description":"Hazlewood to Shivam Dube, SIX, this time Dube nails the pull shot! Into the 90s now with two balls left. Hazlewood tried the short delivery down leg, Dube stood tall and pulled that nicely over backward square leg. Hazlewood grimaces"},{"bowlerId":209,"batterId":105,"score":2,"result":"TWO","description":"Hazlewood to Shivam Dube, 2 runs, in the airrrr, not timed but it\u0027s in the gap. Low full toss, Dube lost shape and played the shot early. Luckily in the gap. 94. One ball to go, six to get for a hundred!"},{"bowlerId":209,"batterId":105,"score":1,"result":"ONE","description":"Hazlewood to Shivam Dube, 1 run, full tosssss, oh he has mistimed it and long off takes it. Dube is gutted. That was a gift of a ball. Oh Faf puts down a sitter, rare! Everyone thought Dube was out, but the side angle clearly showing the ball being grounded and Dhoni did cross for a run"}]}],"secondInnings":[{"over":[{"bowlerId":103,"batterId":201,"score":0,"result":"DOTBALL","description":"Moeen Ali to du Plessis, no run, flighted delivery on the stumps, Faf flicks towards mid-wickets. Wants a quick run, but Anuj Rawat says no"},{"bowlerId":103,"batterId":201,"score":1,"result":"ONE","description":"Moeen Ali to du Plessis, 1 run, very interesting to see Faf not move his feet comfortably to Faf. Flicked to mid-wicket, only one run"},{"bowlerId":103,"batterId":202,"score":0,"result":"DOTBALL","description":"Moeen Ali to Anuj Rawat, no run, flighted delivery on the leg stump, Rawat glances behind square. Now Anuj wants a run, Faf shouts \"No, no, no\""},{"bowlerId":103,"batterId":202,"score":0,"result":"DOTBALL","description":"Moeen Ali to Anuj Rawat, no run, ah turn! Wise of Anuj Rawat to leave that ball alone"},{"bowlerId":103,"batterId":202,"score":0,"result":"DOTBALL","description":"Moeen Ali to Anuj Rawat, no run, oh almost bowled! Anuj Rawat goes for the reverse sweep and misses. Mo thought he had his man, but it brushed the thigh pad and almost kissed leg stump"},{"bowlerId":103,"batterId":202,"score":0,"result":"DOTBALL","description":"Moeen Ali to Anuj Rawat, no run, spinning away just outside off stump, Anuj taps it towards point"}]},{"over":[{"bowlerId":111,"batterId":201,"score":0,"result":"DOTBALL","description":"Mukesh Choudhary to du Plessis, no run, good length delivery hinting at swinging back in but it nipped away. Faf plays a nice push-drive but straight to cover-point"},{"bowlerId":111,"batterId":201,"score":3,"result":"THREE","description":"Mukesh Choudhary to du Plessis, 3 runs, steps out and swings that away across the line, the ball slows down. Sub fielder Subhranshu Senapati hunts it down just in front of the deep mid-wicket boundary"},{"bowlerId":111,"batterId":202,"score":1,"result":"ONE","description":"Mukesh Choudhary to Anuj Rawat, 1 run, outswinger outside off stump, Anuj looks to defend, the ball takes the outside edge and rolls to third man"},{"bowlerId":111,"batterId":201,"score":3,"result":"THREE","description":"Mukesh Choudhary to du Plessis, 3 runs, now Faf flicks to the right of mid-on. Jadeja stops the ball with the slide, but he held the ball so long and almost touched the rope before releasing. Just out of the hand in time"},{"bowlerId":111,"batterId":202,"score":3,"result":"THREE","description":"Mukesh Choudhary to Anuj Rawat, 3 runs, mistimed slog past mid-wicket. It\u0027s Jordan running across from long-on and stopping the ball with his boot at deep mid-wicket. Very good stop but risky for those ankles. Third three of the over and Dhoni runs to Jadeja and asks him to plug gaps in front of square"},{"bowlerId":111,"batterId":201,"score":0,"result":"DOTBALL","description":"Mukesh Choudhary to du Plessis, no run, fullish inswinging delivery, du Plessis defends with soft hands"}]},{"over":[{"bowlerId":110,"batterId":202,"score":1,"result":"ONE","description":"M Theekshana to Anuj Rawat, 1 run, flatter delivery outside off stump, Anuj cuts to backward point"},{"bowlerId":110,"batterId":201,"score":1,"result":"ONE","description":"M Theekshana to du Plessis, 1 run, offie on the leg stump, Faf flicks towards square leg"},{"bowlerId":110,"batterId":202,"score":1,"result":"ONE","description":"M Theekshana to Anuj Rawat, 1 run, nicely timed off-drive but Theekshana has long-off"},{"bowlerId":110,"batterId":201,"score":0,"result":"DOTBALL","description":"M Theekshana to du Plessis, no run, short delivery, deserved to be put away but Faf mistimes the pull to square leg"},{"bowlerId":110,"batterId":201,"score":0,"result":"CATCH","description":"M Theekshana to du Plessis, out Caught by Jordan!! "},{"bowlerId":110,"batterId":203,"score":0,"result":"DOTBALL","description":"M Theekshana to Kohli, no run, on the leg stump, Kohli flicks towards square leg"}]},{"over":[{"bowlerId":103,"batterId":202,"score":0,"result":"DOTBALL","description":"Moeen Ali to Anuj Rawat, no run, spinning away around off stump, Anuj Rawat defends"},{"bowlerId":103,"batterId":202,"score":4,"result":"FOUR","description":"Moeen Ali to Anuj Rawat, FOUR, oh big turn but Anuj Rawat managed to flick that nicely off the back foot. Pitched just outside off stump, Anuj had to adjust and he did well to time that ball. Went to the deep mid-wicket boundary"},{"bowlerId":103,"batterId":202,"score":0,"result":"DOTBALL","description":"Moeen Ali to Anuj Rawat, no run, tries the reverse-sweep. but mistimes it to backward point"},{"bowlerId":103,"batterId":202,"score":1,"result":"ONE","description":"Moeen Ali to Anuj Rawat, 1 run, fullish delivery, Anuj works it to mid-on for a quick single"},{"bowlerId":103,"batterId":203,"score":1,"result":"ONE","description":"Moeen Ali to Kohli, 1 run, flighted delivery just outside off stump, Kohli leans forward and taps it towards cover for a quick single"},{"bowlerId":103,"batterId":202,"score":0,"result":"DOTBALL","description":"Moeen Ali to Anuj Rawat, no run, watchfully defends to slip"}]},{"over":[{"bowlerId":111,"batterId":203,"score":0,"result":"CATCH","description":"Mukesh Choudhary to Kohli, out Caught by Shivam Dube!! "},{"bowlerId":111,"batterId":204,"score":1,"result":"ONE","description":"cover drive two runMukesh Choudhary to Maxwell, 1 run, Maxwell opens the bat face and guides to third man"},{"bowlerId":111,"batterId":202,"score":0,"result":"DOTBALL","description":"Mukesh Choudhary to Anuj Rawat, no run, beaten! Short of a length delivery swinging away outside off stump, Anuj Rawat plays inside the line and misses, he was looking to guide it to third man"},{"bowlerId":111,"batterId":202,"score":1,"result":"ONE","description":"Mukesh Choudhary to Anuj Rawat, 1 run, uppish but safe! Anuj Rawat rushing down for a big shot, the ball takes the bottom of the bat and lands in front of mid-off"},{"bowlerId":111,"batterId":204,"score":4,"result":"FOUR","description":"Mukesh Choudhary to Maxwell, FOUR, a well timed pull shot straightaway from Maxi. RCB need more of this intent from their batters. Short delivery, sat up to be hit, Maxwell pulls over mid-wicket"},{"bowlerId":111,"batterId":204,"score":1,"result":"ONE","description":"Mukesh Choudhary to Maxwell, 1 run, in the airrr, short and almost a runout too! Maxi mistimed the lofted off-drive, went on the bounce to Jadeja. He took off for a run and gave up midway because Jaddu got to the ball very quickly. The CSK captain could have taken a bit of time to aim the throw but he tried to throw in one motion and the balance was off. Luckily for Maxi the throw is wide"}]},{"over":[{"bowlerId":110,"batterId":204,"score":2,"result":"TWO","description":"M Theekshana to Maxwell, 2 runs, moves across and flicks behind square. Just a run oh Bravo fumbles to allow the second run"},{"bowlerId":110,"batterId":204,"score":0,"result":"DOTBALL","description":"M Theekshana to Maxwell, no run, soft appeal for LBW, Maxwell mistimes the reverse sweep, gets an edge onto pad"},{"bowlerId":110,"batterId":204,"score":6,"result":"SIX","description":"M Theekshana to Maxwell, SIX, wow! Pure muscle! That was such a flat hit and the cameraman was in danger. Short delivery, Maxwell stays put and flat-bats over long-off"},{"bowlerId":110,"batterId":204,"score":6,"result":"SIX","description":"M Theekshana to Maxwell, SIX, now high and a long way over mid-wicket. Maxi is teeing off. Game on! Maxwell maximizing the final over of the powerplay. Short delivery, Maxwell pulls handsomely for back-to-back sixes"},{"bowlerId":110,"batterId":204,"score":1,"result":"ONE","description":"M Theekshana to Maxwell, 1 run, mistimed hit but safe. The carrom ball from Theekshana, Maxwell looks to loft off the back foot, slices it and the ball manages to clear the backtracking Jadeja from mid-off"},{"bowlerId":110,"batterId":202,"score":0,"result":"LBW","description":"M Theekshana to Anuj Rawat, THATS OUT!! Lbw!!"}]},{"over":[{"bowlerId":106,"batterId":204,"score":4,"result":"FOUR","description":"Jadeja to Maxwell, FOUR, greets the new bowler with a boundary! Jadeja starts with a shortish ball, Maxwell rocks back deep in his crease and slaps it fiercely through the covers. Speeds away"},{"bowlerId":106,"batterId":204,"score":1,"result":"ONE","description":"Jadeja to Maxwell, 1 run, 91.6kph, in-dart, middle-stump line, knocked down to long-on for a single"},{"bowlerId":106,"batterId":206,"score":2,"result":"TWO","description":"Jadeja to Shahbaz Ahmed, 2 runs, 95.1kph, away-angler from a short of length, scythed past short third man and deep backward point runs to his right to mop it up"},{"bowlerId":106,"batterId":206,"score":1,"result":"ONE","description":"Jadeja to Shahbaz Ahmed, 1 run, 95.7kph, fuller length, pushed towards point"},{"bowlerId":106,"batterId":204,"score":0,"result":"BOWLED","description":"deja to Maxwell, out Bowled!! Knocked him over!"},{"bowlerId":106,"batterId":208,"score":0,"result":"DOTBALL","description":"Jadeja to Prabhudessai, no run, 92.8kph, with a slip in place, Jadeja bowls a length ball and that\u0027s been defensively pushed back at the bowler"}]},{"over":[{"bowlerId":103,"batterId":206,"score":4,"result":"FOUR","description":"Moeen Ali to Shahbaz Ahmed, FOUR, full and drifting in on leg, Shahbaz Ahmed gets down on one leg and sweeps fiercely over backward square leg. Uppish but placed in the gap"},{"bowlerId":103,"batterId":206,"score":4,"result":"ONE","description":"Moeen Ali to Shahbaz Ahmed, 1 run, Moeen Ali pulls his length back, Shahbaz Ahmed allows the ball to spin and works it towards square leg off the back foot. Dhoni is quick to get to the ball"},{"bowlerId":103,"batterId":208,"score":1,"result":"ONE","description":"Moeen Ali to Prabhudessai, 1 run, 85.3kph, Prabhudessai shimmies down and miscues the loft, goes to long-on on the bounce"},{"bowlerId":103,"batterId":206,"score":1,"result":"ONE","description":"Moeen Ali to Shahbaz Ahmed, 1 run, turned to mid-wicket off the back foot for a single"},{"bowlerId":103,"batterId":208,"score":4,"result":"FOUR","description":"Moeen Ali to Prabhudessai, FOUR, Prabhudessai brings out the slogsweep, doesn\u0027t quite middle it. He would have had his heart in his mouth. Mukesh ran across to his right from deep mid-wicket and dived full-length, but the ball was just out of his reach..."},{"bowlerId":103,"batterId":208,"score":1,"result":"ONE","description":"Moeen Ali to Prabhudessai, 1 run, shuffles and nudges towards backward square leg to keep the strike"}]},{"over":[{"bowlerId":106,"batterId":208,"score":4,"result":"FOUR","description":"Jadeja to Prabhudessai, FOUR, 92kph, Prabhudessai makes room by backing away and goes inside-out through extra cover. Struck hard, aerially and in the gap!"},{"bowlerId":106,"batterId":208,"score":1,"result":"ONE","description":"Jadeja to Prabhudessai, 1 run, stump-to-stump line, Prabhudessai shuffles and works it to deep square leg"},{"bowlerId":106,"batterId":206,"score":2,"result":"TWO","description":"Jadeja to Shahbaz Ahmed, 2 runs, clipped through mid-wicket off the back foot for a brace"},{"bowlerId":106,"batterId":206,"score":0,"result":"DOTBALL","description":"Jadeja to Shahbaz Ahmed, no run, 95.3kph, sharp spin + extra bounce! Shahbaz Ahmed is cramped for room and is beaten on the inside edge. Gets hit high on the thigh pad"},{"bowlerId":106,"batterId":206,"score":0,"result":"DOTBALL","description":"Jadeja to Shahbaz Ahmed, no run, in-turner, spinning down leg and Shahbaz Ahmed misses the pull. Brushes the batter\u0027s thigh pad"},{"bowlerId":106,"batterId":206,"score":4,"result":"FOUR","description":"Jadeja to Shahbaz Ahmed, FOUR, full and quick, Shahbaz Ahmed gets down low and elevates it over short fine leg with a sweep shot. Good contact on this occasion"}]},{"over":[{"bowlerId":109,"batterId":208,"score":4,"result":"FOUR","description":"Jordan to Prabhudessai, FOUR, short, wide, asking to be punished. Prabhudessai stands tall and slaps it through extra cover. Not a muscle moved"},{"bowlerId":109,"batterId":208,"score":1,"result":"ONE","description":"Jordan to Prabhudessai, 1 run, 133.7kph, short of a good length, Prabhudessai plays with soft hands and drops it in front of backward point for a sharp single"},{"bowlerId":109,"batterId":206,"score":1,"result":"ONE","description":"Jordan to Shahbaz Ahmed, 1 run, 112.3kph, off-speed ball from round the wicket, Shahbaz Ahmed guides this full ball to backward point and the batters scamper across"},{"bowlerId":109,"batterId":208,"score":4,"result":"FOUR","description":"Jordan to Prabhudessai, FOUR, 135.4kph, cheeky and cute! Length ball, Prabhudessai shuffles across, gets down low and scoops it over short fine leg for a one-bounce four. Superb execution, got it off the middle of the bat"},{"bowlerId":109,"batterId":208,"score":1,"result":"ONE","description":"Jordan to Prabhudessai, 1 run, 110.8kph, slower ball, leg-lined, tucked to deep backward square leg"},{"bowlerId":109,"batterId":206,"score":2,"result":"TWO","description":"Jordan to Shahbaz Ahmed, 2 runs, 105.6kph, slow, full and wide of off, Shahbaz Ahmed slashes it through backward point. 13 runs off the over!"}]},{"over":[{"bowlerId":106,"batterId":208,"score":1,"result":"ONE","description":"Jadeja to Prabhudessai, 1 run, 96kph, flat ball wide of off, jabbed through mid-wicket"},{"bowlerId":106,"batterId":206,"score":2,"result":"TWO","description":"Jadeja to Shahbaz Ahmed, 2 runs, 97.4kph, nudged through square leg and the batters run hard to take two\n"},{"bowlerId":106,"batterId":206,"score":1,"result":"ONE","description":"Jadeja to Shahbaz Ahmed, 1 run, 95.7kph, blunted with the spin towards mid-wicket\n"},{"bowlerId":106,"batterId":208,"score":4,"result":"FOUR","description":"Jadeja to Prabhudessai, FOUR, 99kph, Prabhudessai brings out the reverse-sweep and executes it perfectly. It was the switch it, actually. Gets down, reverses his stance and sent it between backward point and short third man"},{"bowlerId":106,"batterId":208,"score":6,"result":"SIX","description":"Jadeja to Prabhudessai, SIX, wow! Fired in full by Jadeja and Prabhudessai gets down on one leg to nail the slog-sweep. Dispatched over deep square leg for a massive six. Fifty partnership!l"},{"bowlerId":106,"batterId":208,"score":0,"result":"DOTBALL","description":"Jadeja to Prabhudessai, no run, quick, non-turner, Prabhudessai pats it to cover. 14 runs off the over!"}]},{"over":[{"bowlerId":108,"batterId":206,"score":1,"result":"WIDE","description":"Dwayne Bravo to Shahbaz Ahmed, wide, 111.1kph, round the wicket, slow and full way outside off. Shahbaz Ahmed shuffles and lets it pass"},{"bowlerId":108,"batterId":206,"score":0,"result":"DOTBALL","description":"Dwayne Bravo to Shahbaz Ahmed, no run, 130.2kph, quicker one, on the fuller side and wide of off, Shahbaz Ahmed throws his arms at it only to connect with thin air"},{"bowlerId":108,"batterId":206,"score":1,"result":"WIDE","description":"Dwayne Bravo to Shahbaz Ahmed, wide, 104.9kph, errs with his line as he bowls a slower one. Miles wide outside off"},{"bowlerId":108,"batterId":206,"score":4,"result":"FOUR","description":"Dwayne Bravo to Shahbaz Ahmed, FOUR, 127.1kph, low full toss outside off, Shahbaz Ahmed shuffles and batters it through extra cover. Mukesh sprints to his left and dives but to no avail. The timing was spot-on from the left-handed batter"},{"bowlerId":108,"batterId":206,"score":1,"result":"ONE","description":"Dwayne Bravo to Shahbaz Ahmed, 1 run, slower ball from a shortened length, Shahbaz Ahmed waits and dabs it towards short third man"},{"bowlerId":108,"batterId":208,"score":1,"result":"ONE","description":"Dwayne Bravo to Prabhudessai, 1 run, dropped! 129kph, short ball from round the wicket, Prabhudessai moves leg-side and pulls. Miscues as it comes off the top part of the bat. It\u0027s a straightforward chance at deep mid-wicket but Mukesh makes a mess of it. Bravo isn\u0027t a happy man..."},{"bowlerId":108,"batterId":206,"score":1,"result":"ONE","description":"Dwayne Bravo to Shahbaz Ahmed, 1 run, slower ball, full and wide of off, chopped through backward point"},{"bowlerId":108,"batterId":208,"score":1,"result":"ONE","description":"Dwayne Bravo to Prabhudessai, 1 run, 134.3kph, very full, driven down to long-on"}]},{"over":[{"bowlerId":110,"batterId":208,"score":0,"result":"DOTBALL","description":"M Theekshana to Prabhudessai, no run, carrom ball, Prabhudessai defends it back to the bowler"},{"bowlerId":110,"batterId":208,"score":0,"result":"BOWLED","description":"M Theekshana to Prabhudessai, THATS OUT!! Bowled!!"},{"bowlerId":110,"batterId":205,"score":4,"result":"FOUR","description":"M Theekshana to Karthik, FOUR, DK needs no sighters! Drifting onto the pads, Karthik gets down low and sweeps fiercely over short fine leg"},{"bowlerId":110,"batterId":205,"score":1,"result":"ONE","description":"M Theekshana to Karthik, 1 run, brings his wrists into play to clip it away to mid-wicket A slip in place.."},{"bowlerId":110,"batterId":206,"score":0,"result":"DOTBALL","description":"M Theekshana to Shahbaz Ahmed, no run, carrom ball, spins in, pushed towards extra cover and there\u0027s a slight mix-up. A yes-no situation but no issues..."},{"bowlerId":110,"batterId":206,"score":1,"result":"ONE","description":"M Theekshana to Shahbaz Ahmed, 1 run, full on leg, broomed to backward square leg. Six runs and a wicket off the over - good one for CSK"}]},{"over":[{"bowlerId":108,"batterId":206,"score":1,"result":"WIDE","description":"Dwayne Bravo to Shahbaz Ahmed, wide, 104.4kph, loopy, slow ball way outside off. Barely touched the 22-yard strip"},{"bowlerId":108,"batterId":206,"score":4,"result":"FOUR","description":"Dwayne Bravo to Shahbaz Ahmed, FOUR, 110.9kph, slow, full and wide of off, Shahbaz Ahmed throws his arms at it and slices off the outer edge. Backward point - Theekshana - leaps to his left but is out of his reach. The ball dribbles away to the fence"},{"bowlerId":108,"batterId":206,"score":2,"result":"TWO","description":"Dwayne Bravo to Shahbaz Ahmed, 2 runs, slow, full and wide of off, battered through cover point for a couple"},{"bowlerId":108,"batterId":206,"score":1,"result":"ONE","description":"Dwayne Bravo to Shahbaz Ahmed, 1 run, 103.9kph, pace off again, Shahbaz Ahmed waits on the back foot to punch through point"},{"bowlerId":108,"batterId":205,"score":2,"result":"NOBALL","description":"Dwayne Bravo to Karthik, no ball, 1 run, off-pace short of a good length ball from round the wicket, Karthik taps it towards backward point with an opened bat-face. No-ball called; MSD and Rayudu come in to have a word with the umpires. And they are convinced now. There were three fielders behind square on the leg-side. Only two are allowed!"},{"bowlerId":108,"batterId":206,"score":2,"result":"TWO","description":"Dwayne Bravo to Shahbaz Ahmed, 2 runs, low full toss and Shahbaz Ahmed can only drive it through extra cover for a couple"},{"bowlerId":108,"batterId":206,"score":2,"result":"TWO","description":"Dwayne Bravo to Shahbaz Ahmed, 2 runs, off-speed length ball - just 92kph! Punched to sweeper cover"},{"bowlerId":108,"batterId":206,"score":1,"result":"ONE","description":"Dwayne Bravo to Shahbaz Ahmed, 1 run, low full toss, driven down to long-off"}]},{"over":[{"bowlerId":110,"batterId":206,"score":1,"result":"ONE","description":"M Theekshana to Shahbaz Ahmed, 1 run, 90.2kph, nudged into the mid-wicket pocket off the back foot and Dhoni is swift to get to the ball"},{"bowlerId":110,"batterId":205,"score":1,"result":"ONE","description":"M Theekshana to Karthik, 1 run, oh dear! That\u0027s a sitter and Mukesh puts it down. 97.3kph, Karthik swings hard and slices in the air. Mukesh got into a good position to catch, however, somehow he managed to make a mess of it. In and out! Just burst through his fingers..."},{"bowlerId":110,"batterId":206,"score":0,"result":"BOWLED","description":"M Theekshana to Shahbaz Ahmed, out Bowled!! "},{"bowlerId":110,"batterId":207,"score":1,"result":"ONE","description":"M Theekshana to Hasaranga, 1 run, punched towards cover point"},{"bowlerId":110,"batterId":205,"score":6,"result":"SIX","description":"M Theekshana to Karthik, SIX, shot! 99kph, Karthik gets down low, fetches this fullish ball from outside off and middles the slog-sweep to send it over deep backward square leg"},{"bowlerId":110,"batterId":205,"score":0,"result":"DOTBALL","description":"M Theekshana to Karthik, no run, 94kph, nudged to the bowler\u0027s right. Theekshana finishes with 4/33!"}]},{"over":[{"bowlerId":106,"batterId":207,"score":6,"result":"SIX","description":"Jadeja to Hasaranga, SIX, just a flick and it\u0027s gone all the way! Darted in from a short of length, Hasaranga moves leg-side and brings his bottom hand into play to send it over cow corner. Superbly timed!"},{"bowlerId":106,"batterId":207,"score":0,"result":"CATCH","description":"Jadeja to Hasaranga, out Caught by Jordan!!"},{"bowlerId":106,"batterId":211,"score":0,"result":"DOTBALL","description":"Jadeja to Akash Deep, no run, 97.3kph, quick away-turn, Akash Deep gets squared up and pokes it towards short third man"},{"bowlerId":106,"batterId":211,"score":0,"result":"CATCH","description":"Jadeja to Akash Deep, out Caught by Rayudu!! "},{"bowlerId":106,"batterId":210,"score":0,"result":"DOTBALL","description":"Jadeja to Siraj, no run, in-dart, defended into the off-side"},{"bowlerId":106,"batterId":210,"score":0,"result":"DOTBALL","description":"Jadeja to Siraj, no run, fired in, Siraj misses the glance and wears it on the pads. Jadeja appels for lbw but that\u0027s heading down leg"}]},{"over":[{"bowlerId":111,"batterId":205,"score":6,"result":"SIX","description":"Mukesh Choudhary to Karthik, SIX, 126.3kph, harmless short ball from over the wicket. Karthik picks the length early, gets into a strong position with a mini-shuffle and deposits it over deep backward square leg with a pull shot"},{"bowlerId":111,"batterId":205,"score":6,"result":"SIX","description":"Mukesh Choudhary to Karthik, SIX, 135.6kph, fuller length but Choudhary bowls it on the pads. Easy pickings for Karthik who flicks it nonchalantly over deep square leg. Back-to-back sixes!"},{"bowlerId":111,"batterId":205,"score":4,"result":"FOUR","description":"Mukesh Choudhary to Karthik, FOUR, 135.2kph, this is superb batting from DK! Shuffles across a long way to scoop this fullish ball away. Fine leg was too square to cut it off"},{"bowlerId":111,"batterId":205,"score":1,"result":"WIDE","description":"Mukesh Choudhary to Karthik, wide, 133kph, errs with his line wide of off 16 runs off the first three deliveries and Mukesh Choudhary switches to round the wicket"},{"bowlerId":111,"batterId":205,"score":2,"result":"TWO","description":"Mukesh Choudhary to Karthik, 2 runs, 133.3kph, another wide delivery, Karthik goes after it on this occasion. He reaches out and lifts it over wide mid-off for a couple"},{"bowlerId":111,"batterId":205,"score":2,"result":"TWO","description":"Mukesh Choudhary to Karthik, 2 runs, 137.4kph, another full toss wide of off, flayed over extra cover for another couple"},{"bowlerId":111,"batterId":205,"score":1,"result":"WIDE","description":"Mukesh Choudhary to Karthik, wide, 137.7kph, goes for the wide yorker and bowls it outside the tramline, nothing doing from Karthik"},{"bowlerId":111,"batterId":205,"score":1,"result":"ONE","description":"Mukesh Choudhary to Karthik, 1 run, 135.7kph, Karthik decides to loft but doesn\u0027t quite get the timing right. Enough wood to clear a back-pedalling Bravo at mid-off. 23 runs off the over!"}]},{"over":[{"bowlerId":108,"batterId":205,"score":1,"result":"WIDE","description":"Dwayne Bravo to Karthik, wide, 129.9kph, full delivery down leg, past Karthik\u0027s flick. Bravo reckons that it might have brushed Karthik\u0027s pad and isn\u0027t happy with the umpire\u0027s call"},{"bowlerId":108,"batterId":205,"score":1,"result":"WIDE","description":"Dwayne Bravo to Karthik, wide, 96.4kph, slower and shorter, Karthik misses the pull. Another wide"},{"bowlerId":108,"batterId":205,"score":0,"result":"DOTBALL","description":"Dwayne Bravo to Karthik, no run, 132.9kph, fullish delivery, drilled to long-on and they don\u0027t take the single"},{"bowlerId":108,"batterId":205,"score":0,"result":"CATCH","description":"Dwayne Bravo to Karthik, out Caught by Jadeja!! "},{"bowlerId":108,"batterId":209,"score":1,"result":"ONE","description":"Dwayne Bravo to Hazlewood, 1 run, low full toss outside off, Hazlewood eases it to deep backward point"},{"bowlerId":108,"batterId":210,"score":0,"result":"DOTBALL","description":"Dwayne Bravo to Siraj, no run, 128.4kph, yorker outside off, squeezed to short third man"},{"bowlerId":108,"batterId":210,"score":1,"result":"ONE","description":"Dwayne Bravo to Siraj, 1 run, slower ball in the blockhole, jammed towards cover"},{"bowlerId":108,"batterId":209,"score":1,"result":"ONE","description":"Dwayne Bravo to Hazlewood, 1 run, 102.7kph, off-speed, pitched up outside off, chipped towards long-off"}]},{"over":[{"bowlerId":109,"batterId":209,"score":1,"result":"ONE","description":"Jordan to Hazlewood, 1 run, 130.9kph, skiddy length ball, Hazlewood is early to close his bat-face and gets a leading edge towards backward point"},{"bowlerId":109,"batterId":210,"score":0,"result":"DOTBALL","description":"Jordan to Siraj, no run, 138.3kph, low full toss outside off, a shuffling Siraj tries to play a premeditated scoop shot and doesn\u0027t know where the ball is. It hit the lower half of the bat and went towards point"},{"bowlerId":109,"batterId":210,"score":1,"result":"ONE","description":"Jordan to Siraj, 1 run, 135.9kph, pitched up delivery, Siraj backs away and drives to mid-off"},{"bowlerId":109,"batterId":209,"score":0,"result":"DOTBALL","description":"Jordan to Hazlewood, no run, yorker length outside off, Hazlewood fails to lay bat on ball"},{"bowlerId":109,"batterId":209,"score":1,"result":"ONE","description":"Jordan to Hazlewood, 1 run, 134kph, around the blockhole again, jammed towards mid-off"},{"bowlerId":109,"batterId":210,"score":4,"result":"FOUR","description":"Jordan to Siraj, FOUR, 134.7kph, fullish delivery, Siraj clears his front leg and swings his bat hard to slash it through extra cover. No chance for deep cover to cut it off"}]},{"over":[{"bowlerId":108,"batterId":209,"score":2,"result":"TWO","description":"Dwayne Bravo to Hazlewood, 2 runs, 121.5kph, slow, full and wide of off, Hazlewood stays deep to go over extra cover. Jadeja runs back and jumps but is out of his reach..."},{"bowlerId":108,"batterId":209,"score":2,"result":"WIDE","description":"Dwayne Bravo to Hazlewood, wide, even slower but errs with his line outside off"},{"bowlerId":108,"batterId":209,"score":1,"result":"ONE","description":"Dwayne Bravo to Hazlewood, 1 run, 125.6kph, low full toss outside off, Hazlewood eases it to deep point"},{"bowlerId":108,"batterId":210,"score":0,"result":"DOTBALL","description":"Dwayne Bravo to Siraj, no run, 127.4kph, yorker outside off, Siraj can\u0027t put bat on ball as he tries to squeeze it out"},{"bowlerId":108,"batterId":210,"score":4,"result":"FOUR","description":"Dwayne Bravo to Siraj, FOUR, 96.9kph, very slow, too full, Siraj thumps it over the non-striker\u0027s head and Hazlewood had to duck under it"},{"bowlerId":108,"batterId":210,"score":0,"result":"DOTBALL","description":"Dwayne Bravo to Siraj, no run, 127.9kph, banged in short, Siraj misses the pull"},{"bowlerId":108,"batterId":210,"score":4,"result":"FOUR","description":"Dwayne Bravo to Siraj, FOUR, 126kph, overpitched, Siraj audaciously plays a helicopter shot to batter it straight of mid-off. First win of the season for CSK!"}]}],"firstTeamId":100,"secondTeamId":200,"firstPlayingEleven":[{"playerId":101,"playerName":"Uthappa","playerType":"BATTER","currentTeam":100},{"playerId":102,"playerName":"Gaikwad","playerType":"BATTER","currentTeam":100},{"playerId":103,"playerName":"Moeen Ali","playerType":"ALLROUNDER","currentTeam":100},{"playerId":104,"playerName":"Rayudu","playerType":"BATTER","currentTeam":100},{"playerId":105,"playerName":"Shivam Dube","playerType":"ALLROUNDER","currentTeam":100},{"playerId":106,"playerName":"Jadeja","playerType":"ALLROUNDER","currentTeam":100},{"playerId":107,"playerName":"Dhoni","playerType":"BATTER","currentTeam":100},{"playerId":108,"playerName":"Dwayne Bravo","playerType":"ALLROUNDER","currentTeam":100},{"playerId":109,"playerName":"Jordan","playerType":"BOWLER","currentTeam":100},{"playerId":110,"playerName":"M Theekshana","playerType":"BOWLER","currentTeam":100},{"playerId":111,"playerName":"Mukesh Chowdary","playerType":"BOWLER","currentTeam":100}],"secondPlayingEleven":[{"playerId":201,"playerName":"Du Plessis","playerType":"BATTER","currentTeam":200},{"playerId":202,"playerName":"Anuj Rawat","playerType":"BATTER","currentTeam":200},{"playerId":203,"playerName":"Kohili","playerType":"BATTER","currentTeam":200},{"playerId":204,"playerName":"Maxwell","playerType":"ALLROUNDER","currentTeam":200},{"playerId":205,"playerName":"Dinesh Karthik","playerType":"BATTER","currentTeam":200},{"playerId":206,"playerName":"Shahbaz Ahmed","playerType":"ALLROUNDER","currentTeam":200},{"playerId":207,"playerName":"Hasaranga","playerType":"ALLROUNDER","currentTeam":200},{"playerId":208,"playerName":"Peabhudessai","playerType":"BATTER","currentTeam":200},{"playerId":209,"playerName":"Hazelwood","playerType":"BOWLER","currentTeam":200},{"playerId":210,"playerName":"Siraj","playerType":"BOWLER","currentTeam":200},{"playerId":211,"playerName":"Akash Deep","playerType":"BOWLER","currentTeam":200}],"firstInningsScore":218,"secondInningsScore":197,"firstInningsWickets":4,"secondInningsWickets":9,"iplMatchesPath":"database/ipl/matches/"}